Tekla.Structures.ModelInternal.GeometryExporter
GeometryExporter class provides tools to export part geometry.

Tekla.Structures.ModelInternal.GeometryExporter.ParentOfTheRootIndex
The value used in place of parent index for the root node

Tekla.Structures.ModelInternal.GeometryExporter.RootIndex
The root node index

Tekla.Structures.ModelInternal.GeometryExporter.#ctor
Initializes a new instance of the GeometryExporter class

Tekla.Structures.ModelInternal.GeometryExporter.ExportedPointList
Gets or sets the list of points to export as part of the marshaling process

Tekla.Structures.ModelInternal.GeometryExporter.ExportedIntList
Gets or sets the list of integers to export as part of the marshaling process

Tekla.Structures.ModelInternal.GeometryExporter.MatrixToGlobal
Gets or sets the transformation matrix to local

Tekla.Structures.ModelInternal.GeometryExporter.CurrentNodeParentId
Gets or sets the id of the parent of the current node being exported

Tekla.Structures.ModelInternal.GeometryExporter.ExportGeometry(Tekla.Structures.ModelInternal.GeometryTree)
Export the geometry to core
geometry: The geometry to export.
Returns: true if successful

Tekla.Structures.ModelInternal.GeometryExporter.ExportGeometries(System.Collections.Generic.IList{Tekla.Structures.ModelInternal.GeometryTree})
Export several geometries to core
geometries: The geometries to export.
Returns: true if successful

Tekla.Structures.ModelInternal.GeometryExporter.ProcessPolygon(Tekla.Structures.Model.PolygonNode)
Process a node that is an instance of PolygonNode node
node: the geometry node to process

Tekla.Structures.ModelInternal.GeometryExporter.ProcessBend(Tekla.Structures.Model.BendSurfaceNode)
Process a node that is an instance of BendSurfaceNode
node: the geometry node to process

Tekla.Structures.ModelInternal.GeometryExporter.ProcessSpiral(Tekla.Structures.ModelInternal.SpiralNode)
Process a node that is an instance of HelixNode
node: the geometry node to process

Tekla.Structures.ModelInternal.GeometryExporter.ExportNodeType(Tekla.Structures.Model.IGeometryNode)
Get the marshaled value for the type and sub-type of the geometry node.
node: the geometry node whose type is exported
Returns: int value encoding the type and sub-type of the node

Tekla.Structures.ModelInternal.GeometryExporter.ExportGeometryNode(Tekla.Structures.ModelInternal.GeometryTree,Tekla.Structures.Model.IGeometryNode,System.Int32,System.Int32)
Recursively export the geometry node and its children to arrays for transferring
geometry: The geometry being exported
node: The geometry node to export
parentNodeId: The id of node parent
nodeId: The id assigned to node
Returns: the next available node id